cmsis-svd/cmsis-svd/data/Infineon/s6e2hgxg.svd
        <!-- REGISTER "BREG72" -->
        <register>
          <name>BREG72</name>
          <description>Backup Register</description>
          <addressOffset>0x172</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG73" -->
        <register>
          <name>BREG73</name>
          <description>Backup Register</description>
          <addressOffset>0x173</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG74" -->
        <register>
          <name>BREG74</name>
          <description>Backup Register</description>
          <addressOffset>0x174</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG75" -->
        <register>
          <name>BREG75</name>
          <description>Backup Register</description>
          <addressOffset>0x175</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG76" -->
        <register>
          <name>BREG76</name>
          <description>Backup Register</description>
          <addressOffset>0x176</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG77" -->
        <register>
          <name>BREG77</name>
          <description>Backup Register</description>
          <addressOffset>0x177</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG78" -->
        <register>
          <name>BREG78</name>
          <description>Backup Register</description>
          <addressOffset>0x178</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG79" -->
        <register>
          <name>BREG79</name>
          <description>Backup Register</description>
          <addressOffset>0x179</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG7A" -->
        <register>
          <name>BREG7A</name>
          <description>Backup Register</description>
          <addressOffset>0x17A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG7B" -->
        <register>
          <name>BREG7B</name>
          <description>Backup Register</description>
          <addressOffset>0x17B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG7C" -->
        <register>
          <name>BREG7C</name>
          <description>Backup Register</description>
          <addressOffset>0x17C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG7D" -->
        <register>
          <name>BREG7D</name>
          <description>Backup Register</description>
          <addressOffset>0x17D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG7E" -->
        <register>
          <name>BREG7E</name>
          <description>Backup Register</description>
          <addressOffset>0x17E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG7F" -->
        <register>
          <name>BREG7F</name>
          <description>Backup Register</description>
          <addressOffset>0x17F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "LSCRP" -->
    <peripheral>
      <name>LSCRP</name>
      <description>Low-speed CR Prescaler</description>
      <version>A</version>
      <groupName>LSCRP</groupName>
      <baseAddress>0x4003C000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "LCR_PRSLD" -->
        <register>
          <name>LCR_PRSLD</name>
          <description>Low-speed CR Prescaler Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCR_PRSLD" -->
            <field>
              <name>LCR_PRSLD</name>
              <description>Low-speed CR Prescaler Load</description>
              <msb>5</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
